
## Plan Result

[CI link](https://github.com/hayas1/tfgh/actions/runs/11836989626)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * module.repositories[&#34;tfgh&#34;].github_repository_file.this[&#34;github/labeler.yml&#34;]
* Delete
  * github_issue_label.update-snippets


<details><summary>Change Result (Click me)</summary>

```hcl

  # github_issue_label.update-snippets will be destroyed
  # (because github_issue_label.update-snippets is not in configuration)
  - resource "github_issue_label" "update-snippets" {
      - color       = "E9C4AA" -> null
      - description = "Replace pull request managed by terraform" -> null
      - etag        = "W/\"78ed634c7982ab3fb0bd02ec9787da31281d19bade77e2bb56004dec92edf5d9\"" -> null
      - id          = "tfgh:update-snippets" -> null
      - name        = "update-snippets" -> null
      - repository  = "tfgh" -> null
      - url         = "https://api.github.com/repos/hayas1/tfgh/labels/update-snippets" -> null
    }

  # module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
          - 
          - update-snippets:
          -   - changed-files:
          -     - any-glob-to-any-file:
          -       - 'terraform/module/repository/github/**'
          -       - 'terraform/additional/**'
        EOT
        id                              = "tfgh/.github/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "8150f61bf5d62aeff025c77c3c712d6ac6dac26c" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "61efa6e9365a25fdf3cdd71f562022240c7a05ac" -> (known after apply)
      ~ id                    = "hayas1:tfgh:59" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "manual",
        ] -> (known after apply)
      ~ number                = 59 -> (known after apply)
      ~ opened_at             = 1731427164 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731513886 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"6dc52c8dea42db6f1adb11018e708101cd424abff23232d6886285458a9c97f6\"" -> "W/\"8863b1ef2d6305c102db855527b800c182944ecd0fd9a6e1cceeb588bfe577e3\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"79e06c30efb6fcfeb13756b51df946179a4f682e0197a8d0a9fa3fe6a92d925c\"" -> "W/\"4a679d1e66cac40a3efe7ee211fcac039ed0cca8e16e04170480778932b066c0\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"531ca4c2a1c77f6d6eb236fcbf9f64105a36b3424b3cdedff813dd913b4556d8\"" -> "W/\"608b393a2f047d1f0b1996d7411b0b1ce805b5369ddcdb5ab87de95bb9a32941\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":64,"Program":"tfcmt","SHA1":"f2b7b4430ab234ec80a04f4ce2bb7dd9baffd8a3","Vars":{},"WorkflowName":"Terraform plan on pull request"} -->